*** xtask/src/lib.rs:24:5: replace workspace_root -> Result<std::path::PathBuf, String> with Ok(Default::default())

*** mutation diff:
--- xtask/src/lib.rs
+++ replace workspace_root -> Result<std::path::PathBuf, String> with Ok(Default::default())
@@ -16,19 +16,16 @@
         Some("gate-selftest") => selftest::run_all(),
         Some(other) => Err(format!("unknown command `{other}`\n{USAGE}")),
         None => Err(USAGE.to_string()),
     }
 }
 
 /// The workspace root, one level above xtask's manifest.
 pub(crate) fn workspace_root() -> Result<std::path::PathBuf, String> {
-    std::path::Path::new(env!("CARGO_MANIFEST_DIR"))
-        .parent()
-        .map(std::path::Path::to_path_buf)
-        .ok_or_else(|| "xtask has no parent directory".to_string())
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod intent_graph {
     //! xtask's own instance of the graph checks (README §4.2).
     lid::intent_graph!();
 }

---- selftest::tests::every_gate_fixture_fails_its_gate stdout ----

thread 'selftest::tests::every_gate_fixture_fails_its_gate' (8277909) panicked at xtask/src/selftest.rs:240:19:

---- selftest::tests::surviving_mutants_fail_the_gate stdout ----

thread 'selftest::tests::surviving_mutants_fail_the_gate' (8277912) panicked at xtask/src/selftest.rs:224:37:
the vacuous-test fixture must leave a surviving mutant, and the gate must report it as failure: "reading clippy.toml: No such file or directory (os error 2)"

---- mutants::tests::diff_scope_writes_a_real_diff_file stdout ----

thread 'mutants::tests::diff_scope_writes_a_real_diff_file' (8277898) panicked at xtask/src/mutants.rs:345:14:
git diff HEAD must succeed in this repository: "running cd \"\" && \"git\" \"diff\" \"HEAD\": No such file or directory (os error 2)"

failures:
    mutants::tests::diff_scope_writes_a_real_diff_file
    selftest::tests::every_gate_fixture_fails_its_gate
    selftest::tests::surviving_mutants_fail_the_gate

test result: FAILED. 15 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.70s

*** result: Failure(101)
