*** xtask/src/selftest.rs:119:5: replace manifest -> String with "xyzzy".into()

*** mutation diff:
--- xtask/src/selftest.rs
+++ replace manifest -> String with "xyzzy".into()
@@ -111,47 +111,17 @@
     write(dir.join("src/lib.rs"), &source)?;
     Ok(dir)
 }
 
 /// The synthesized crate's manifest: the workspace's lint set inlined, a
 /// `[workspace]` table so the parent workspace is not adopted, and `lid` as a
 /// path dependency where the fixture cites specs.
 fn manifest(fixture: &Fixture, root: &Path) -> String {
-    let lid_dep = if fixture.needs_lid {
-        format!("lid = {{ path = {:?} }}\n", root.join("lid"))
-    } else {
-        String::new()
-    };
-    format!(
-        r#"[package]
-name = "{name}"
-version = "0.0.0"
-edition = "2024"
-
-[dependencies]
-{lid_dep}
-[workspace]
-
-[lints.rust]
-missing_docs = "deny"
-
-[lints.rustdoc]
-broken_intra_doc_links = "deny"
-
-[lints.clippy]
-cognitive_complexity = "warn"
-fn_params_excessive_bools = "warn"
-too_many_lines = "warn"
-wildcard_enum_match_arm = "deny"
-missing_docs_in_private_items = "warn"
-"#,
-        name = fixture.name,
-        lid_dep = lid_dep,
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The gate command for a fixture kind.
 fn gate_command(gate: Gate) -> Command {
     let mut command = cargo_command();
     match gate {
         Gate::Check => {
             command.args(["check", "--all-targets"]);

---- selftest::tests::surviving_mutants_fail_the_gate stdout ----

thread 'selftest::tests::surviving_mutants_fail_the_gate' (8274923) panicked at xtask/src/selftest.rs:194:37:

---- selftest::tests::every_gate_fixture_fails_its_gate stdout ----

thread 'selftest::tests::every_gate_fixture_fails_its_gate' (8274922) panicked at xtask/src/selftest.rs:210:19:

failures:
    selftest::tests::every_gate_fixture_fails_its_gate
    selftest::tests::surviving_mutants_fail_the_gate

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 13 filtered out; finished in 0.21s

*** result: Failure(101)
