*** xtask/src/selftest.rs:85:5: replace check_fixture -> Result<(), String> with Ok(())

*** mutation diff:
--- xtask/src/selftest.rs
+++ replace check_fixture -> Result<(), String> with Ok(())
@@ -77,20 +77,17 @@
         .iter()
         .find(|f| f.name == name)
         .ok_or_else(|| format!("no fixture named `{name}`"))?;
     check_fixture(fixture)
 }
 
 /// Synthesizes and gates one fixture.
 fn check_fixture(fixture: &Fixture) -> Result<(), String> {
-    let dir = synthesize(fixture)?;
-    let mut command = gate_command(fixture.gate);
-    command.current_dir(&dir);
-    expect_gate_failure(&mut command, fixture.expect)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Synthesizes the detached crate for a fixture under
 /// `target/gate-selftest/<name>` and returns its directory.
 fn synthesize(fixture: &Fixture) -> Result<PathBuf, String> {
     let root = workspace_root()?;
     let dir = root.join("target/gate-selftest").join(fixture.name);
     let write = |path: PathBuf, content: &str| {

---- selftest::tests::every_gate_fixture_fails_its_gate stdout ----

thread 'selftest::tests::every_gate_fixture_fails_its_gate' (8273796) panicked at xtask/src/selftest.rs:241:13:
run_all must have exercised broken_doc_link

---- selftest::tests::surviving_mutants_fail_the_gate stdout ----

thread 'selftest::tests::surviving_mutants_fail_the_gate' (8273797) panicked at xtask/src/selftest.rs:227:9:
run_fixture must actually synthesize and run the fixture

failures:
    selftest::tests::every_gate_fixture_fails_its_gate
    selftest::tests::surviving_mutants_fail_the_gate

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 13 filtered out; finished in 0.06s

*** result: Failure(101)
