*** lid-rs-macros/src/expand.rs:164:5: replace parse_spec_paths -> syn::Result<Vec<Path>> with Ok(vec![])

*** mutation diff:
--- lid-rs-macros/src/expand.rs
+++ replace parse_spec_paths -> syn::Result<Vec<Path>> with Ok(vec![])
@@ -156,29 +156,17 @@
         .map_err(|e| syn::Error::new(e.span(), "lid-rs: expected a single foreign-ID string literal"))?;
     let mut item: DeriveInput = syn::parse2(item)?;
     item.attrs.push(parse_quote!(#[doc(alias = #id)]));
     Ok(item.into_token_stream())
 }
 
 /// Parses a citation argument list: one or more plain, non-generic paths.
 fn parse_spec_paths(args: TokenStream) -> syn::Result<Vec<Path>> {
-    let span = proc_macro2::Span::call_site();
-    let paths: Punctuated<Path, Token![,]> =
-        Punctuated::parse_terminated.parse2(args).map_err(|e| {
-            syn::Error::new(e.span(), "lid-rs: expected a comma-separated list of spec paths")
-        })?;
-    if paths.is_empty() {
-        return Err(syn::Error::new(
-            span,
-            "lid-rs: cite at least one spec, or remove the attribute",
-        ));
-    }
-    paths.iter().try_for_each(ensure_plain_path)?;
-    Ok(paths.into_iter().collect())
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Rejects path segments carrying generic arguments.
 fn ensure_plain_path(path: &Path) -> syn::Result<()> {
     if path.segments.iter().any(|s| !s.arguments.is_none()) {
         return Err(syn::Error::new_spanned(
             path,
             "lid-rs: spec paths are plain paths — a claim type takes no generic arguments",

---- intent_graph::registry_is_populated stdout ----

thread 'intent_graph::registry_is_populated' (8658043) panicked at lid-rs/src/lib.rs:18:5:
canary triple missing - registry sections were stripped or never populated (README §5.3)

---- intent_graph::every_spec_has_an_implementer stdout ----

thread 'intent_graph::every_spec_has_an_implementer' (8658041) panicked at lid-rs/src/lib.rs:18:5:
canary triple missing - registry cannot be trusted (README §5.3): CanaryStripped

---- intent_graph::every_spec_has_a_validation stdout ----

thread 'intent_graph::every_spec_has_a_validation' (8658040) panicked at lid-rs/src/lib.rs:18:5:
canary triple missing - registry cannot be trusted (README §5.3): CanaryStripped

failures:
    canary::tests::canary_confirms_registry_presence
    canary::tests::linked_registrations_are_enumerable
    intent_graph::every_spec_has_a_validation
    intent_graph::every_spec_has_an_implementer
    intent_graph::registry_is_populated
    spec::tests::implements_citations_register_edges
    spec::tests::malformed_citations_fail_to_compile
    spec::tests::module_citations_trace_by_containment
    spec::tests::validates_citations_register_edges

test result: FAILED. 9 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.32s

*** result: Failure(101)
