*** lid-rs-macros/src/expand.rs:181:5: replace ensure_plain_path -> syn::Result<()> with Ok(())

*** mutation diff:
--- lid-rs-macros/src/expand.rs
+++ replace ensure_plain_path -> syn::Result<()> with Ok(())
@@ -173,23 +173,17 @@
         ));
     }
     paths.iter().try_for_each(ensure_plain_path)?;
     Ok(paths.into_iter().collect())
 }
 
 /// Rejects path segments carrying generic arguments.
 fn ensure_plain_path(path: &Path) -> syn::Result<()> {
-    if path.segments.iter().any(|s| !s.arguments.is_none()) {
-        return Err(syn::Error::new_spanned(
-            path,
-            "lid-rs: spec paths are plain paths — a claim type takes no generic arguments",
-        ));
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders a path for the doc line, joining segments the way it was written.
 fn render_path(path: &Path) -> String {
     let joined = path
         .segments
         .iter()
         .map(|s| s.ident.to_string())

error: lid-rs: spec paths are plain paths — a claim type takes no generic arguments
 --> tests/ui/fail/generic_path.rs:3:22
  |
3 | #[lid_rs::implements(Vec<u8>)]
  |                      ^^^^^^^
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈

error[E0277]: the trait bound `Vec<u8>: Spec` is not satisfied
 --> tests/ui/fail/generic_path.rs:3:22
  |
3 | #[lid_rs::implements(Vec<u8>)]
  |                      ^^^^^^^ the trait `Spec` is not implemented for `Vec<u8>`
  |
  = help: the following other types implement trait `Spec`:
            CanaryConfirmsRegistryPresence
            CanaryDetectsAStrippedRegistry
            CoveredGraphsPassTheGraphCheck
            DerivedSpecsCarryTheirDefinitionPath
            DerivedSpecsRegisterIntoSpecs
            GraphChecksRequireThePresentCanary
            GraphChecksScopeToTheCurrentCrate
            ImplementsCitationsRegisterEdges
          and $N others
┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈
note: If the actual output is the correct output you can bless it by rerunning
      your test with the environment variable TRYBUILD=overwrite

---- spec::tests::malformed_citations_fail_to_compile stdout ----

thread 'spec::tests::malformed_citations_fail_to_compile' (8659767) panicked at /Users/brad/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/trybuild-1.0.120/src/run.rs:103:13:
1 of 12 tests failed

failures:
    spec::tests::malformed_citations_fail_to_compile

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.81s

*** result: Failure(101)
