*** lid-rs-macros/src/expand.rs:223:5: replace edge_registration -> TokenStream with Default::default()

*** mutation diff:
--- lid-rs-macros/src/expand.rs
+++ replace edge_registration -> TokenStream with Default::default()
@@ -215,23 +215,10 @@
 /// The `concat!(module_path!(), "::", ident)` expression naming a cited item.
 fn item_path_expr(ident: &syn::Ident) -> TokenStream {
     let name = ident.to_string();
     quote!(concat!(module_path!(), "::", #name))
 }
 
 /// One registration in the contract form from `docs/intent/registry/lld.md`.
 fn edge_registration(verb: &Verb, path: &Path, item_expr: &TokenStream) -> TokenStream {
-    let slice = verb.slice();
-    quote! {
-        const _: () = {
-            #[allow(missing_docs, clippy::missing_docs_in_private_items)]
-            #[::lid_rs::__private::linkme::distributed_slice(#slice)]
-            #[linkme(crate = ::lid_rs::__private::linkme)]
-            static EDGE: ::lid_rs::Edge = ::lid_rs::Edge {
-                spec: <#path as ::lid_rs::Spec>::NAME,
-                item: #item_expr,
-                file: file!(),
-                line: line!(),
-            };
-        };
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }

error: custom attribute panicked
  --> lid-rs/src/canary.rs:24:1
   |
24 | #[implements(spec::CanaryConfirmsRegistryPresence)]
   | ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
   |
   = help: message: unexpected end of input, expected an expression

error: custom attribute panicked
  --> lid-rs/src/canary.rs:34:1
   |
34 | #[implements(spec::CanaryDetectsAStrippedRegistry)]
   | ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
   |
   = help: message: unexpected end of input, expected an expression

*** result: Failure(101)
