*** lid-rs-macros/src/expand.rs:70:5: replace ensure_unit_struct -> syn::Result<()> with Ok(())

*** mutation diff:
--- lid-rs-macros/src/expand.rs
+++ replace ensure_unit_struct -> syn::Result<()> with Ok(())
@@ -62,24 +62,17 @@
                 line: line!(),
             };
         };
     })
 }
 
 /// Rejects derive targets that are not plain unit structs.
 fn ensure_unit_struct(item: &DeriveInput) -> syn::Result<()> {
-    let unit = matches!(&item.data, Data::Struct(s) if matches!(s.fields, Fields::Unit));
-    if !unit || !item.generics.params.is_empty() {
-        return Err(syn::Error::new_spanned(
-            &item.ident,
-            "lid-rs: derive(Spec) applies to non-generic unit structs only — a claim has no runtime shape",
-        ));
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Expands `#[implements]` / `#[validates]`: dispatches on the item kind.
 ///
 /// Dispatch is by parse-attempt rather than by matching `syn::Item`: that
 /// enum is foreign and `#[non_exhaustive]`, so it cannot be matched without
 /// the wildcard arm check 6 denies — and rejecting unknown item kinds is the
 /// wanted behaviour anyway.

---- spec::tests::malformed_citations_fail_to_compile stdout ----

thread 'spec::tests::malformed_citations_fail_to_compile' (8654658) panicked at /Users/brad/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/trybuild-1.0.120/src/run.rs:103:13:
1 of 12 tests failed

failures:
    spec::tests::malformed_citations_fail_to_compile

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.25s

*** result: Failure(101)
