*** xtask/src/mutants.rs:137:5: replace parse_mutants -> Result<Vec<Mutant>, String> with Ok(vec![])

*** mutation diff:
--- xtask/src/mutants.rs
+++ replace parse_mutants -> Result<Vec<Mutant>, String> with Ok(vec![])
@@ -129,23 +129,17 @@
         args.push(d.display().to_string());
     }
     args
 }
 
 /// Parses the engine's JSON mutant list. Blank output is a valid empty
 /// listing: with an empty `--in-diff` the engine prints nothing, not `[]`.
 fn parse_mutants(json: &str) -> Result<Vec<Mutant>, String> {
-    if json.trim().is_empty() {
-        return Ok(Vec::new());
-    }
-    let value: serde_json::Value =
-        serde_json::from_str(json).map_err(|e| format!("parsing mutant list: {e}"))?;
-    let array = value.as_array().ok_or("mutant list is not a JSON array")?;
-    array.iter().map(mutant_of).collect()
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Extracts one mutant's identity fields.
 fn mutant_of(value: &serde_json::Value) -> Result<Mutant, String> {
     let get = |pointer: &str| {
         value
             .pointer(pointer)
             .and_then(serde_json::Value::as_str)

---- mutants::tests::diff_scope_writes_a_real_diff_file stdout ----

thread 'mutants::tests::diff_scope_writes_a_real_diff_file' (8292356) panicked at xtask/src/mutants.rs:343:14:

failures:
    mutants::tests::diff_scope_writes_a_real_diff_file

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 13 filtered out; finished in 1.85s

*** result: Failure(101)
